(feat): adding mermaids
